* fib while loop
  #+BEGIN_SRC js :results output
    let n1 = 0;
    let n2 = 1;
    let count = 0;
    let fib = 0;
    while (count < 10) {
	fib = n1 + n2;
	n1 = n2;
	n2 = fib;
	count += 1;
    }
    console.log(n1) 
  #+END_SRC

  #+RESULTS:
  : 55
* while loop
  #+BEGIN_SRC js :results output
    let result = 1;
    for(let i = 0; i <= 10; i++) {
	result = result / 2;
    }
    console.log(result);
  #+END_SRC

  #+RESULTS:
  : 0.00048828125

* exercises

** #Triangle
   
  #+BEGIN_SRC js :results output
    for (let tri = "#"; tri.length <= 7; tri += "#" ) {
      console.log(tri);
    }
  #+END_SRC

  #+RESULTS:
  : #
  : ##
  : ##
  : ####
  : #####
  : ######
  : #######

** FizzBuzz
   #+begin_src js :results output
	  for (let i = 1; i <= 100; i++ ) {
	  if (i % 15 == 0) {
	    console.log('FizzBuzz');
	  }
	    else if (i % 3 == 0) {
	      console.log("Fizz");
	    }
	    else if ( i % 5 == 0) {
	      console.log("Buzz");
	    }
	  else console.log(i);
	  } // in this code i was over reliant on 'else if' statements & console log
     // i also couldn't figure out how to produce the word fizzbuzz from each statement
// concatination is powerful as is the OR operator
   #+end_src

   #+RESULTS:
   #+begin_example
   1
   2
   Fizz
   4
   Buzz
   Fizz
   7
   8
   Fizz
   Buzz
   11
   Fizz
   13
   14
   FizzBuzz
   16
   17
   Fizz
   19
   Buzz
   Fizz
   22
   23
   Fizz
   Buzz
   26
   Fizz
   28
   29
   FizzBuzz
   31
   32
   Fizz
   34
   Buzz
   Fizz
   37
   38
   Fizz
   Buzz
   41
   Fizz
   43
   44
   FizzBuzz
   46
   47
   Fizz
   49
   Buzz
   Fizz
   52
   53
   Fizz
   Buzz
   56
   Fizz
   58
   59
   FizzBuzz
   61
   62
   Fizz
   64
   Buzz
   Fizz
   67
   68
   Fizz
   Buzz
   71
   Fizz
   73
   74
   FizzBuzz
   76
   77
   Fizz
   79
   Buzz
   Fizz
   82
   83
   Fizz
   Buzz
   86
   Fizz
   88
   89
   FizzBuzz
   91
   92
   Fizz
   94
   Buzz
   Fizz
   97
   98
   Fizz
   Buzz
   #+end_example


** Chessboard
  #+Begin_SRC js :results output
    let x = 8
    let b = "#"
    let w = "0"
    let i = 1
    //let f = ""
    //let s =""
    for (i; i <= x; i++ ) {
	if (i % 1 == 0) {
	   
	 console.log(f);
	}
	else 
	console.log(s);
    }
  #+END_SRC

  #+RESULTS:

  #+BEGIN_SRC js :results output
    let x = 8
    let board = ""
    let i = 1
    let j = 1
    for ( i; i <= x; i++) {
	if (i % 2 === 1) { //creating odd line
	    for (j; j<= x/2; j++) { //creating line order
		board +=  " ";
		board += "#";
	    }	
	else  //creating even lines
	    for (j; j <= x/2; j++) {
		board =+  "#";
		board += " ";
	    }
	"\n"
	}
    }
    console.log(board);

    }
  #+END_SRC

  #+BEGIN_SRC js :results output
    let x = 8
    let board = ""
    let i = 1
    let j = 1
    let k = 1
    for ( i; i <= x; i++) {
	if (i % 2 === 1) { //creating odd line
	    for (j; j<= x/2; j++) { //creating line order
		board +=  " ";
		board += "#";
	    }
	}
	    else //creating even lines
		for (k; k <= x/2; k++) {
		    board +=  "#";
		    board += " ";
		}	    
	console.log(board);
    }
  #+END_SRC  

  #+BEGIN_SRC js :results output
    let x = 8
    let board = ""
    let i = 1
    for ( i; i <= x; i++) {
	while(board.length <= x){
	    if (i % 2 == 1) {
		board +=  " ";
		board += "#";
	    }
	    else{
		board +=  "#";
		board += " ";
	    }
	"\n";
	}
    }
console.log(board)
  #+END_SRC  

  #+RESULTS:
  :  # # # # #
  
